src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РежимРаботыСетиСтоматологий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимРаботыСетиСтоматологий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕдинаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОбластиДоступаGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбластиДоступаGoogle</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Профиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контакты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/НастройкаПараметровУчета/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти
  
 #Область ОбработчикиСобытийФормы
 
&НаСервере 
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НарядЗаказУвеличиваетЗадолженность.ТолькоПросмотр = НЕ НаборКонстант.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов;
	
	ИдентификацияПриложенияGoogle = Константы.ИдентификацияПриложенияGoogle.Получить();
	Если ЗначениеЗаполнено(ИдентификацияПриложенияGoogle) Тогда
		СинхронизацияКалендаряGoogle = РегистрыСведений.СеансовыеДанныеGoogle.ОбластьДоступаGoogleКалендарьВключена();
	Иначе
		СинхронизацияКалендаряGoogle = Ложь;
	КонецЕсли; 
	
	ОписаниеРежимаРаботыСетиСтоматологии();
	                                                   
	НастройкиОнлайнЗаписиПриСоздании();
	
	//ОбновитьНастройкиОтправкиСообщений("Форма");
	
КонецПроцедуры  

&НаСервере
// Процедура - Обновить настройки отправки сообщений
//
// Параметры:
//  Назначение	 - 	 - 
//
Процедура ОбновитьНастройкиОтправкиСообщений(Назначение)
	
	//Если Назначение = "Форма" Тогда
	//	// Читаем
	//	НастройкиОтправки_Сообщений = Константы.НастройкиОтправкиСообщений.СведенияОНастройкахОтправкиСообщений();
	//	ВремяОтправкиСообщенийС 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиОтправки_Сообщений, "ВремяОтправкиСообщенийС"		, Дата(1,1,1));
	//	ВремяОтправкиСообщенийПо 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиОтправки_Сообщений, "ВремяОтправкиСообщенийПо"	, Дата(1,1,1));
	//	// Выводим
	//	Элементы.НастроитьВремяОтправкиС.Заголовок 	= Формат(ВремяОтправкиСообщенийС	, "ДФ=HH:mm");
	//	Элементы.НастроитьВремяОтправкиПо.Заголовок = Формат(ВремяОтправкиСообщенийПо	, "ДФ=HH:mm");
	//ИначеЕсли Назначение = "БазаДанных" Тогда
	//	// Выводим
	//	Элементы.НастроитьВремяОтправкиС.Заголовок 	= Формат(ВремяОтправкиСообщенийС	, "ДФ=HH:mm");
	//	Элементы.НастроитьВремяОтправкиПо.Заголовок = Формат(ВремяОтправкиСообщенийПо	, "ДФ=HH:mm");
	//	
	//	НастройкиОтправки_Сообщений = Константы.НастройкиОтправкиСообщений.НовоеОписаниеНастроекОтправкиСообщений();
	//	НастройкиОтправки_Сообщений.ВремяОтправкиСообщенийС 	= ВремяОтправкиСообщенийС;
	//	НастройкиОтправки_Сообщений.ВремяОтправкиСообщенийПо 	= ВремяОтправкиСообщенийПо;
	//	// Сохраняем
	//	Константы.НастройкиОтправкиСообщений.УстановитьНастройкиОтправкиСообщений(НастройкиОтправки_Сообщений);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность = Истина Тогда
		ЭтаФорма.Записать();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОкрытии"
//
Процедура ПриОткрытии(Отказ)
	
	// УстановитьВидимость();
	
КонецПроцедуры   

&НаСервере 
// Процедура, "При записи на сервере".
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность = Истина Тогда 
		
		Если ЗначениеЗаполнено(ЗапретОнлайнЗаписиС) И Не ЗначениеЗаполнено(ЗапретОнлайнЗаписиПо)
			ИЛИ ЗначениеЗаполнено(ЗапретОнлайнЗаписиПо) И Не ЗначениеЗаполнено(ЗапретОнлайнЗаписиС) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для ограничения онлайн записи за период необходимо заполнить дату начала и дату окончания запрета!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВиджетОнлайнЗаписи) Тогда
			ЗаписатьПараметрыВнешнейСистемыСервер();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПослеЗаписи"
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьИнтерфейс();
	Оповестить("ИЗМЕНЕНА_НАСТРОЙКА_АВТОМАТИЧЕСКОЙ_ГЕНЕРАЦИИ_ДОКУМЕНТОВ_ПОСТУПЛЕНИЯ");
	
КонецПроцедуры

&НаСервере
// Процедура - Настройки онлайн записи при создании
//
Процедура НастройкиОнлайнЗаписиПриСоздании()
	
	ЭтотОбъект.ВиджетОнлайнЗаписи 				   = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.ВиджетОнлайнЗаписи); 	
	ЭтотОбъект.ВиджетОнлайнЗаписиАвторизацияБезСМС = ЭтотОбъект.ВиджетОнлайнЗаписи.АвторизацияПоКодуБезСМС;
	
	ПараметрыВС = ЭтотОбъект.ВиджетОнлайнЗаписи.Параметры.Получить();
	
	Если ТипЗнч(ПараметрыВС) = Тип("Структура") Тогда 					
		
		ЭтотОбъект.РазделенныеПоляФИО		= ?(ПараметрыВС.Свойство("РазделенныеПоляФИО")		, ПараметрыВС.РазделенныеПоляФИО		, Неопределено);
		ЭтотОбъект.ВыводитьДатуРождения 	= ?(ПараметрыВС.Свойство("ВыводитьДатуРождения")	, ПараметрыВС.ВыводитьДатуРождения		, Неопределено);
		ЭтотОбъект.ВыводитьПочту			= ?(ПараметрыВС.Свойство("ВыводитьПочту")			, ПараметрыВС.ВыводитьПочту				, Неопределено);
		ЭтотОбъект.ВыводитьПолеНапоминания	= ?(ПараметрыВС.Свойство("ВыводитьПолеНапоминания")	, ПараметрыВС.ВыводитьПолеНапоминания	, Ложь);
		ЭтотОбъект.FacebookPixel			= ?(ПараметрыВС.Свойство("FacebookPixel")			, ПараметрыВС.FacebookPixel				, Неопределено);
		ЭтотОбъект.ЗапретОнлайнЗаписиС		= ?(ПараметрыВС.Свойство("ЗапретОнлайнЗаписиС")		, ПараметрыВС.ЗапретОнлайнЗаписиС		, Неопределено);
		ЭтотОбъект.ЗапретОнлайнЗаписиПо		= ?(ПараметрыВС.Свойство("ЗапретОнлайнЗаписиПо")	, ПараметрыВС.ЗапретОнлайнЗаписиПо		, Неопределено);
						
	КонецЕсли;

	ДоступныеТипыАвторизации = Константы.ДоступныеТипыАвторизации.Получить().Получить();
	
	Если ТипЗнч(ДоступныеТипыАвторизации) = Тип("Структура") И ДоступныеТипыАвторизации.Свойство("СписокТиповАвторизации") Тогда
		
		ЭтотОбъект.СписокТиповАвторизации = ДоступныеТипыАвторизации.СписокТиповАвторизации;
		
		Для Каждого ТипАвторизации Из ЭтотОбъект.СписокТиповАвторизации Цикл
			Если ТипАвторизации.Пометка Тогда
				УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(Элементы[ТипАвторизации.Значение],, Истина);	
			КонецЕсли;
		КонецЦикла;			
		
	Иначе 
		ЭтотОбъект.СписокТиповАвторизации.Добавить("whats_app"	, "WhatsApp");
		ЭтотОбъект.СписокТиповАвторизации.Добавить("sms"		, "СМС");
		ЭтотОбъект.СписокТиповАвторизации.Добавить("email"		, "Email");
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	УстановитьДоступностьТиповАвторизации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
// Процедура, "Использовать автоматическую отправку получение данных МДЛП При Изменении".
//
Процедура ИспользоватьАвтоматическуюОтправкуПолучениеДанныхМДЛППриИзменении(Элемент)
	
    Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры 

 &НаКлиенте
// Процедура Использовать УЕТ.
//
Процедура ФункциональнаяОпцияИспользоватьУЕТПриИзменении(Элемент) 
	
	УстановитьКонстантуУЕТ(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура Применять скидки по планам лечения.
//
Процедура ПрименятьСкидкиПоПланамЛеченияПриИзменении(Элемент)  
	
	УстановитьКонстантуСкидокПоПланамЛечения(); 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Учитывать авансы в разрезе планов лечения и наряд заказов при изменении
//
Процедура УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказовПриИзменении(Элемент)
	
	Если НаборКонстант.УчитыватьАвансыВРазрезеПлановЛеченияИНарядЗаказов = Ложь Тогда
		НаборКонстант.НарядЗаказУвеличиваетЗадолженность           = Ложь;
		Элементы.НарядЗаказУвеличиваетЗадолженность.ТолькоПросмотр = Истина;
	Иначе
		Элементы.НарядЗаказУвеличиваетЗадолженность.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры
  
&НаКлиенте
// Процедура - Сервис SMSРассылки по умолчанию при изменении
//
Процедура СервисSMSРассылкиПоУмолчаниюПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "При изменении" поля формы "Режим работы сети стоматологий"
//
Процедура РежимРаботыСетиСтоматологийПриИзменении(Элемент) 
	
	ОписаниеРежимаРаботыСетиСтоматологии(); 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Синхронизация календаря google при изменении
//
Процедура СинхронизацияКалендаряGoogleПриИзменении(Элемент)
	
	ОбновитьИспользованиеОбластиДоступаПриложениеGoogle();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Идентификация приложения google при изменении
// 
Процедура ИдентификацияПриложенияGoogleПриИзменении(Элемент)
	
	ПроверитьОбновитьИдентификацияПриложенияGoogle();
	
КонецПроцедуры

&НаКлиенте
Процедура ВиджетОнлайнЗаписиАвторизацияБезСМСПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти     

#Область ОбработчикиКомандФормы

&НаКлиенте 
// Обработчик события "Синхронизировать календарь Google".
//
Процедура СинхронизироватьКалендарьGoogle(Команда)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
	"e1cib/command/Обработка.ОбменСGoogle.Команда.СинхронизироватьКалендарьGoogle");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Настроить время отправки С
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура НастроитьВремяОтправкиС(Команда)
	
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ДатаВремя"			, НачалоДня(ТекущаяДата()) + (Час(ВремяОтправкиСообщенийС)*60*60) + (Минута(ВремяОтправкиСообщенийС)*60));
	//ПараметрыФормы.Вставить("ШагМинут"			, 10);	

	//ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеВыбранногоВремени", ЭтотОбъект, Новый Структура("ИмяРеквизита", "ВремяОтправкиСообщенийС"));
	//ОткрытьФорму("ОбщаяФорма.ВыборВремениДня", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Настроить время отправки по
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура НастроитьВремяОтправкиПо(Команда)
	
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ДатаВремя"			, НачалоДня(ТекущаяДата()) + (Час(ВремяОтправкиСообщенийПо)*60*60) + (Минута(ВремяОтправкиСообщенийПо)*60));
	//ПараметрыФормы.Вставить("ШагМинут"			, 10);	

	//ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеВыбранногоВремени", ЭтотОбъект, Новый Структура("ИмяРеквизита", "ВремяОтправкиСообщенийПо"));
	//ОткрытьФорму("ОбщаяФорма.ВыборВремениДня", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
// Процедура - Получение выбранного времени
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПолучениеВыбранногоВремени(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	//Если Результат <> Неопределено Тогда
	//	ЭтотОбъект[ДополнительныеПараметры.ИмяРеквизита] = Результат;
	//	ОбновитьНастройкиОтправкиСообщений("БазаДанных");
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обработчик события кнопки "Настроить"
//
Процедура НастроитьНажатие(Элемент)
	
   ПолучитьРасписаниеРегламентногоЗадания();
   
   Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание); 
   Диалог.Показать(Новый ОписаниеОповещения("НастроитьНажатиеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));

КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик оповещения модального вызова
// 
Процедура НастроитьНажатиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
		
	Если Не Расписание = Неопределено Тогда

		ЭтотОбъект.Расписание = Расписание; 	
		СохранитьРасписание(); 
		УстановитьНадписьРасписания();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура выполняет получение расписания регламентного задания
//
Процедура ПолучитьРасписаниеРегламентногоЗадания()	
	
	Если ПравоДоступа("Администрирование", Метаданные) Тогда
		Расписание = РегламентныеЗадания.НайтиПредопределенное("АктуализацияСтатусовПациентов").Расписание;
	Иначе
		Расписание = "Доступно для администратора.";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура выполняет сохранение расписания регламентного задания
//
Процедура СохранитьРасписание()
	
	Задание = РегламентныеЗадания.НайтиПредопределенное("АктуализацияСтатусовПациентов");
	Задание.Расписание = Расписание;
	Задание.Записать();
	
КонецПроцедуры

&НаСервере
// Процедура выполняет установку надписи расписания
//
Процедура УстановитьНадписьРасписания()
	
	Если ПравоДоступа("Администрирование", Метаданные) Тогда
		
		Расписание                   = РегламентныеЗадания.НайтиПредопределенное("АктуализацияСтатусовПациентов").Расписание; 	
		ПрефиксРасписания            = "Расписание проставления статуса: "; 	
		ТекстРасписания              = ПрефиксРасписания + Строка(Расписание); 	
		Элементы.Настроить.Заголовок = ТекстРасписания;
		
	Иначе
		
		Элементы.Настроить.Видимость    = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - выводит описание выбранного режима работы сети стоматологий
//
Процедура ОписаниеРежимаРаботыСетиСтоматологии()
	
	ОписаниеРежимаРаботыСетиСтоматологии = ?(НаборКонстант.РежимРаботыСетиСтоматологий = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть, 
	"Лицевой счет, оборот и история по клиенту общая для всех стоматологий сети.",
	?(НаборКонстант.РежимРаботыСетиСтоматологий = Перечисления.РежимРаботыСетиСтоматологий.Обособленно,
	"Лицевой счет, оборот и история по клиенту ведется обособлено в каждой из стоматологий сети.",
	""));   	
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет установку видимости элементов
//
Процедура УстановитьВидимость()
			
	
КонецПроцедуры

&НаСервере  
// Процедура, "Обновить использование области доступа приложение Google"
//
Процедура ОбновитьИспользованиеОбластиДоступаПриложениеGoogle()
	
	РегистрыСведений.СеансовыеДанныеGoogle.ОтключитьОбластьДоступа(
	Перечисления.ОбластиДоступаGoogle.Календарь,
	Не СинхронизацияКалендаряGoogle);
	
КонецПроцедуры
	
&НаСервере  
// Процедура, "Проверить обновить идентификация приложения Google"
//
Процедура ПроверитьОбновитьИдентификацияПриложенияGoogle()
	
	ЗначениеКорректно = Истина;
	
	Если Не ПустаяСтрока(ИдентификацияПриложенияGoogle) Тогда
		ТекстОшибки = ОбменСGoogle.ИдентификацияПриложенияGoogleКорректна(ИдентификацияПриложенияGoogle);
		ЗначениеКорректно = ПустаяСтрока(ТекстОшибки);
	КонецЕсли;
	
	Если ЗначениеКорректно Тогда
		Константы.ИдентификацияПриложенияGoogle.Установить(ИдентификацияПриложенияGoogle);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , Элементы.ИдентификацияПриложенияGoogle.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает занчение константы.
//
Процедура УстановитьКонстантуУЕТ() 
	
	Константы.ИспользоватьУЕТ.Установить(НаборКонстант.ИспользоватьУЕТ);
	
КонецПроцедуры

&НаСервере
// Процедура устанавливает занчение константы.
//
Процедура УстановитьКонстантуСкидокПоПланамЛечения() 
	
	Константы.ПрименятьСкидкиПоПланамЛечения.Установить(НаборКонстант.ПрименятьСкидкиПоПланамЛечения); 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Клиент

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ИмяКонстанты = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
	Если ИмяКонстанты <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Вызов сервера

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным); 
	ОбновитьПовторноИспользуемыеЗначения();
	Возврат ИмяКонстанты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	Если ЧастиИмени.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКонстанты = ЧастиИмени[1];
	КонстантаМенеджер = Константы[ИмяКонстанты];
	КонстантаЗначение = НаборКонстант[ИмяКонстанты];
	
	Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
		КонстантаМенеджер.Установить(КонстантаЗначение);
	КонецЕсли;
	
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
// Процедура - Установить доступность типов авторизации
//
Процедура УстановитьДоступностьТиповАвторизации()
		
	Элементы.ГруппаКнопкиWA.Доступность		= ЗначениеЗаполнено(Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi));	
	Элементы.ГруппаКнопкиEmail.Доступность	= ПроверитьВозможностьИспользованияEmailРассылки();	
	Элементы.ГруппаКнопкиСМС.Доступность	= ПроверитьВозможностьИспользованияSMSРассылки();

КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов
//
Процедура УстановитьВидимостьЭлементов()
	
	//Элементы.ГруппаКнопокУправленияТипамиАвторизации.Видимость	= Не ВиджетОнлайнЗаписиАвторизацияБезСМС;
	Элементы.FacebookPixelПредставление.Заголовок				= ?(ЗначениеЗаполнено(FacebookPixel), "Редактировать", "Заполнить");
	
КонецПроцедуры

&НаСервере
// Функция, проверяет возможность использования eamil рассылки.
//
Функция ПроверитьВозможностьИспользованияEmailРассылки()
	
	ДоступныеУчетныеЗаписи = ЭлектроннаяПочта.ПолучитьДоступныеУчетныеЗаписи(Истина);	
	УчетнаяЗапись		   = ?(ДоступныеУчетныеЗаписи.Количество() > 0, ДоступныеУчетныеЗаписи[0].Ссылка, Неопределено);
	
	Возврат ЗначениеЗаполнено(УчетнаяЗапись) И УчетнаяЗапись.ИспользоватьДляОтправки = Истина;
	
КонецФункции

&НаСервере
// Функция, проверяет возможность использования sms рассылки.
//
Функция ПроверитьВозможностьИспользованияSMSРассылки()
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	
	Если Не ЗначениеЗаполнено(СервисSMSРассылки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	БалансАккаунтаSMS = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисSMSРассылки);
	
	Возврат БалансАккаунтаSMS.Ошибка = Ложь И ТипЗнч(БалансАккаунтаSMS.Баланс) = Тип("Число") И БалансАккаунтаSMS.Баланс > 0;
	
КонецФункции

&НаКлиенте
// Процедура - Команда управления типами авторизации
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура КомандаУправленияТипамиАвторизации(Команда)
	
	Модифицированность = Истина;
	ТекЭлемент		= ЭтаФорма.ТекущийЭлемент;	
	ЭлементСписка	= СписокТиповАвторизации.НайтиПоЗначению(ТекЭлемент.Имя);
	
	Если ЭлементСписка = Неопределено Тогда
		СписокТиповАвторизации.Добавить(ТекЭлемент.Имя, ТекЭлемент.Заголовок, Истина);
		Активность = Ложь;
	Иначе
		Активность = Не ЭлементСписка.Пометка;
		ЭлементСписка.Пометка = Активность;
	КонецЕсли;
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(ТекЭлемент,, Активность,,, 4);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Facebook pixel представление нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура FacebookPixelПредставлениеНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок", "Редактирование метрики facebook");
	ПараметрыОткрытия.Вставить("Текст", FacebookPixel);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактированияFacebookPixel", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияТекстовогоПоля", ПараметрыОткрытия,,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
// Процедура - После редактирования facebook pixel
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеРедактированияFacebookPixel(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Свойство("Текст") Тогда		
		FacebookPixel	= Результат.Текст;
		Модифицированность = Истина;
	КонецЕсли;
	
	Элементы.FacebookPixelПредставление.Заголовок = ?(ЗначениеЗаполнено(FacebookPixel), "Редактировать", "Заполнить"); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - При изменении реквизита для виджета
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ПриИзмененииРеквизитаДляВиджета(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
// Процедура - Записать параметры внешней системы клиент
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗаписатьПараметрыВнешнейСистемыСервер()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("РазделенныеПоляФИО"		, РазделенныеПоляФИО);
	СтруктураПараметров.Вставить("ВыводитьДатуРождения"		, ВыводитьДатуРождения);
	СтруктураПараметров.Вставить("ВыводитьПочту"			, ВыводитьПочту);
	СтруктураПараметров.Вставить("FacebookPixel"			, FacebookPixel);
	СтруктураПараметров.Вставить("ЗапретОнлайнЗаписиС"		, ЗапретОнлайнЗаписиС);
	СтруктураПараметров.Вставить("ЗапретОнлайнЗаписиПо"		, ЗапретОнлайнЗаписиПо);
	СтруктураПараметров.Вставить("ВыводитьПолеНапоминания"	, ВыводитьПолеНапоминания);
	
	ЗаписатьКонстантуДоступныеТипыАвторизации(СписокТиповАвторизации);	
	ЗаписатьВнешнююСистему(ВиджетОнлайнЗаписи, ВиджетОнлайнЗаписиАвторизацияБезСМС, СтруктураПараметров);
		
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать константу доступные типы авторизации
//
Процедура ЗаписатьКонстантуДоступныеТипыАвторизации(СписокТиповАвторизации)
	Константы.ДоступныеТипыАвторизации.Установить(Новый ХранилищеЗначения(Новый Структура("СписокТиповАвторизации"	, СписокТиповАвторизации)));	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, сохраняет внешнюю систему.
//
Процедура ЗаписатьВнешнююСистему(ВиджетОнлайнЗаписи, АвторизацияПоКодуБезСМС, ПараметрыВС)
	
	ВнешняяСистемаОбъект = ВиджетОнлайнЗаписи.ПолучитьОбъект();
	
	Если АвторизацияПоКодуБезСМС <> ВиджетОнлайнЗаписи.АвторизацияПоКодуБезСМС Тогда
		ВнешняяСистемаОбъект.АвторизацияПоКодуБезСМС = АвторизацияПоКодуБезСМС;     
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыВС) И ТипЗнч(ПараметрыВС) = Тип("Структура") Тогда
		
		ПараметрыВнешнейСистемы = ВнешняяСистемаОбъект.Параметры.Получить();
		
		Если ПараметрыВнешнейСистемы = Неопределено Тогда 
			ПараметрыВнешнейСистемы = Новый Структура();
		КонецЕсли;
		
		Для Каждого ПараметрВС Из ПараметрыВС Цикл
			
			Если ПараметрыВнешнейСистемы.Свойство(ПараметрВС.Ключ) Тогда 
				ПараметрыВнешнейСистемы[ПараметрВС.Ключ] = ПараметрВС.Значение;
			Иначе
				ПараметрыВнешнейСистемы.Вставить(ПараметрВС.Ключ, ПараметрВС.Значение);
			КонецЕсли;
			
		КонецЦикла;		
		
		ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
		
	КонецЕсли;
	
	ВнешняяСистемаОбъект.Записать();
	             
	ИспользуемыеСтруктурныеЕдиницы = Неопределено;
	ПараметрыВнешнейСистемы = ВиджетОнлайнЗаписи.Параметры.Получить();
	Если ПараметрыВнешнейСистемы <> Неопределено И ПараметрыВнешнейСистемы.Свойство("ИспользуемыеСтруктурныеЕдиницы") Тогда
		ИспользуемыеСтруктурныеЕдиницы = ПараметрыВнешнейСистемы.ИспользуемыеСтруктурныеЕдиницы;
	КонецЕсли;
	
	Если ИспользуемыеСтруктурныеЕдиницы <> Неопределено Тогда
		ЛичныйКабинет.ЗарегистироватьВиджет(ПолучитьОрганизациюСалона(), ВиджетОнлайнЗаписи.КлючПриложения, ИспользуемыеСтруктурныеЕдиницы)
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить организацию салона
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьОрганизациюСалона()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И НЕ Организации.ЭтоГруппа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаКлиенте
// Процедура - Открывает настройка Wallet.
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияНастроитьНажатие(Элемент)
	
	ВнешняяСистемаWallet = ПолучитьВнешнююСистемуНаСервере();	
	
	Если ЗначениеЗаполнено(ВнешняяСистемаWallet) Тогда
		
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаНастройкиЭлектронныхКартWallet", Новый Структура("Ключ", ВнешняяСистемаWallet));
		
	Иначе
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Wallet")));
		
		ОткрытьФорму("Справочник.ВнешниеСистемы.Форма.ФормаНастройкиЭлектронныхКартWallet", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция, получить внешнюю систему.
//
Функция ПолучитьВнешнююСистемуНаСервере()
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet, Ложь, Неопределено);		
	
КонецФункции

#КонецОбласти
